import { Component, OnInit } from '@angular/core';

@Component({
    selector: 'app-faqs',
    templateUrl: './faqs.component.html',
    styleUrls: [ './faqs.component.scss' ],
})
export class FaqsComponent implements OnInit {
    faqs = {
        questions: [
            {
                question: 'هل يمكن الاشتراك في أكثر من باقة؟',
                answer: `يمكنك اختيار أحد المهارات التي ترغب في تعلمها وسنقوم بتوفير تدريب خاص بهذه المهارة، يمكنك اختيار أحد المهارات التي ترغب في تعلمها وسنقوم بتوفير يمكنك اختيار أحد المهارات التي ترغب في تعلمها وسنقوم بتوفير تدريب خاص بهذه المهارة، يمكنك اختيار أحد المهارات التي ترغب في تعلمها وسنقوم بتوفير تدريب خاص بهذه المهارةتدريب خاص بهذه المهارة`,
            },
            {
                question: 'هل يمكنني استرداد قيمة الباقة الملغية؟',
                answer: `يمكنك اختيار أحد المهارات التي ترغب في تعلمها وسنقوم بتوفير تدريب خاص بهذه المهارة، يمكنك اختيار أحد المهارات التي ترغب في تعلمها وسنقوم بتوفير يمكنك اختيار أحد المهارات التي ترغب في تعلمها وسنقوم بتوفير تدريب خاص بهذه المهارة، يمكنك اختيار أحد المهارات التي ترغب في تعلمها وسنقوم بتوفير تدريب خاص بهذه المهارةتدريب خاص بهذه المهارة`,
            },
            {
                question: 'هل يمكنني إلغاء الباقة؟',
                answer: `يمكنك اختيار أحد المهارات التي ترغب في تعلمها وسنقوم بتوفير تدريب خاص بهذه المهارة، يمكنك اختيار أحد المهارات التي ترغب في تعلمها وسنقوم بتوفير يمكنك اختيار أحد المهارات التي ترغب في تعلمها وسنقوم بتوفير تدريب خاص بهذه المهارة، يمكنك اختيار أحد المهارات التي ترغب في تعلمها وسنقوم بتوفير تدريب خاص بهذه المهارةتدريب خاص بهذه المهارة`,
            },
            {
                question: 'هل يمكن الاشتراك في أكثر من باقة؟',
                answer: `يمكنك اختيار أحد المهارات التي ترغب في تعلمها وسنقوم بتوفير تدريب خاص بهذه المهارة، يمكنك اختيار أحد المهارات التي ترغب في تعلمها وسنقوم بتوفير يمكنك اختيار أحد المهارات التي ترغب في تعلمها وسنقوم بتوفير تدريب خاص بهذه المهارة، يمكنك اختيار أحد المهارات التي ترغب في تعلمها وسنقوم بتوفير تدريب خاص بهذه المهارةتدريب خاص بهذه المهارة`,
            },
        ],
    };
    constructor() {}

    ngOnInit(): void {}
}
